import { ReactNode } from "react"
const IntroData = [["国家","中国"],["国家","中国"],["国家","中国"],["国家","中国"],["国家","中国"],["国家","中国"],["国家","中国"],["国家","中国"],["国家","中国"]]
const raceColumn = ["赛季","国家队","上场","首发","进球","助攻","红牌","黄牌"]
// 总和不能超过750px 比赛信息的table
const raceWidth = ["120px","120px","85px","85px","85px","85px","85px","85px"]
// 转会信息的 Width数组
const transferColumn = ["时间","来自"," ","去往","详情"]
const transferWidth = ["150px","180px","40px","180px","200px"]
const priceWidth = ["200px","100px","100px","100px","100px","100px","100px","100px","100px"]
const raceData:(string|ReactNode)[][] = [["2022","比利时","4","4","2","2","0","0"],["2022","比利时","4","4","2","2","0","0"],["2022","比利时","4","4","2","2","0","0"],["2022","比利时","4","4","2","2","0","0"],["2022","比利时","4","4","2","2","0","0"],["2022","比利时","4","4","2","2","0","0"],["2022","比利时","4","4","2","2","0","0"]]
const transferData : (string|ReactNode)[][] = [["2022/01/01","切尔西","比利时","转会费 (7500 万欧元)"],["2022/01/01","切尔西","比利时","转会费 (7500 万欧元)"],["2022/01/01","切尔西","比利时","转会费 (7500 万欧元)"],["2022/01/01","切尔西","比利时","转会费 (7500 万欧元)"],["2022/01/01","切尔西","比利时","转会费 (7500 万欧元)"],["2022/01/01","切尔西","比利时","转会费 (7500 万欧元)"]]
export {
    priceWidth,
    transferWidth,
    transferData,
    raceData,
    raceColumn,
    raceWidth,
    IntroData,
    transferColumn
}